#include<stdio.h>
#include<stdlib.h>
#include<math.h>
int main() {
	int y, m, d, seed, i,num;
	char name[5] = { '0','0','0','0','0' };
	char* Pgb[24] = { "勇敢的","热情的","聪明的","充满激情的","善良的","有创造力的","勤奋的","充满爱心的","有耐心的","慷慨的","有冒险精神的","充满好奇心的","有领导能力的","乐观的","有责任心的","积极的","有想象力的","自信的","有序的","诚实的","有远见的","灵活的","有自制力的","成熟的"};
	char* Tgb[24] = { "有前途的","稳步发展的","成功的","有希望的","繁荣的","有意义的","稳定的","充满机会的","有益的","充满活力的","理想的","富有成效的","成功的","有成就的","繁荣兴旺的","有价值的","前途光明的","不断增长的","有序的","有效的","成功的","稳定的","充满机会的","有益的" };
	char* Pbb[24] = { "恶毒的","冷漠的","固执的","消极的","无能的","虚伪的","懒惰的","沮丧的","无精打采的","脾气暴躁的","粗鲁的","不诚实的","脾气不好的","自私的","卑鄙的","心胸狭窄的","有敌意的","残忍的","不友好的","刻薄的","难以取悦的","不愉快的","不合作的","不易相处的" };
	char* Tbb[24] = { "难以成功的","不稳定的","失败的","充满风险的","没有前途的","坎坷不平的","不符合预期的","艰难的","遭受挫折的","充满挑战的","难以实现的","不成功的","遭受损失的","不稳定的","危险的","没有未来的","遭受打击的","无法成功的","无法满足期望的","无法带来成功的","无法实现目标的","不符合期望的","无法取得成功的","不被看好的" };
	printf("一种基于用户输入数据\n生成伪随机数用于赛博算命的程序");
	printf("请输入姓名 生日以开始算命\n输入格式例子:丁真 2077 2 15\n请严格按照输入格式，不然出bug自行负责\n懒得写判断输入数据是否合法了\n本程序只供娱乐\n");
	printf("请:\n");
	while (~scanf("%s %d %d %d", name, &y, &m, &d))
	{
		seed = y + m + d;
		for (i = 1; i <= 5; i++) {
			if (name[i] == '0') { break; }
			else { seed += abs(name[i]); }
		}//算种子
		srand(seed);
		num = rand();//得到随机数
		num = abs(23*sin(num));
		printf("算出来了!\n个人性格:%s、%s\n事业运势：%s、%s\n请:\n", Pgb[num], Pbb[num], Tgb[num], Tbb[num]);
	}
}